{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,32,128,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D3","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D4","class_name":"MaxPooling2D","config":{"pool_size":[2,1],"padding":"valid","strides":[2,1],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":256,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D4",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[32,256],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"bidirectional_Bidirectional1","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"GRU","config":{"name":"gru_GRU1","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":1,"reset_after":false,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional1","trainable":true},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"bidirectional_Bidirectional2","class_name":"Bidirectional","config":{"merge_mode":"concat","layer":{"class_name":"GRU","config":{"name":"gru_GRU2","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"recurrent_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":1,"reset_after":false,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"bidirectional_Bidirectional2","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":37,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["bidirectional_Bidirectional2",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense1",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,3,128,256],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[256],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[2,1,256,256],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[256],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_gru_GRU1/kernel","shape":[256,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_gru_GRU1/recurrent_kernel","shape":[128,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/forward_gru_GRU1/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_gru_GRU1/kernel","shape":[256,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_gru_GRU1/recurrent_kernel","shape":[128,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional1/backward_gru_GRU1/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_gru_GRU2/kernel","shape":[256,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_gru_GRU2/recurrent_kernel","shape":[128,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/forward_gru_GRU2/bias","shape":[384],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_gru_GRU2/kernel","shape":[256,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_gru_GRU2/recurrent_kernel","shape":[128,384],"dtype":"float32"},{"name":"bidirectional_Bidirectional2/backward_gru_GRU2/bias","shape":[384],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[256,37],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[37],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[256],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[256],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}